In [2]:
import pandas as pd
import numpy as np
import numpy.random as randn
import string

In [3]:
df = pd.DataFrame(np.random.randn(5,5),index='A/B/C/D/E'.split('/'), columns ='V/W/X/Y/Z'.split('/'))
df

          V         W         X         Y         Z
A -2.366218 -0.170413  0.106012 -1.357577 -0.447824
B  0.754288 -1.746705 -1.263410  1.489953 -1.026629
C -0.087286  1.215492  0.280479  1.345137 -1.162273
D -1.204467 -1.207007 -0.385640 -1.300729  1.157541
E  1.183392  0.352365 -0.698854 -0.212740  0.284761

In [4]:
df.loc['D'][['X','Z']] #GRABBING ROWS AND COLOUMN
#NOTICE WE'RE USING TWO BRACKETS SINCE THERE ARE 2 ELEMENTS

X   -0.385640
Z    1.157541
Name: D, dtype: float64

In [5]:
df[['X','Z']].loc['D']

X   -0.385640
Z    1.157541
Name: D, dtype: float64

In [6]:
df[['X','Z']].iloc[3]

X   -0.385640
Z    1.157541
Name: D, dtype: float64

In [7]:
df.head() #THIS WILL RETURN THE FIRST 5 ROWS OF THE DATA FRAME

          V         W         X         Y         Z
A -2.366218 -0.170413  0.106012 -1.357577 -0.447824
B  0.754288 -1.746705 -1.263410  1.489953 -1.026629
C -0.087286  1.215492  0.280479  1.345137 -1.162273
D -1.204467 -1.207007 -0.385640 -1.300729  1.157541
E  1.183392  0.352365 -0.698854 -0.212740  0.284761

In [8]:
df.tail() #THIS WILL RETURN THE LAST 5 ROWS OF THE DATA FRAME

          V         W         X         Y         Z
A -2.366218 -0.170413  0.106012 -1.357577 -0.447824
B  0.754288 -1.746705 -1.263410  1.489953 -1.026629
C -0.087286  1.215492  0.280479  1.345137 -1.162273
D -1.204467 -1.207007 -0.385640 -1.300729  1.157541
E  1.183392  0.352365 -0.698854 -0.212740  0.284761

In [9]:
df.tail(2)

          V         W         X         Y         Z
D -1.204467 -1.207007 -0.385640 -1.300729  1.157541
E  1.183392  0.352365 -0.698854 -0.212740  0.284761

# CONCATENATE

In [10]:
df1 = pd.DataFrame({'A':['A0','A1','A2','A3'],
                    'B':['B0','B1','B2','B3'],
                    'C': ['C0','C1','C2','C3']},index = [0,1,2,3])

In [11]:
df1

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3

In [12]:
df2 = pd.DataFrame({'A':['A4','A5','A6','A7'],
                    'B':['B4','B5','B6','B7'],
                    'C': ['C4','C5','C6','C7']},index = [0,1,2,3])

In [13]:
df2

    A   B   C
0  A4  B4  C4
1  A5  B5  C5
2  A6  B6  C6
3  A7  B7  C7

In [14]:
pd.concat([df1,df2])

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
0  A4  B4  C4
1  A5  B5  C5
2  A6  B6  C6
3  A7  B7  C7

In [15]:
pd.concat([df1,df2], axis=1) #THE AXIS = 1 CONCATENATES SIDE BY SIDE 
#AXIS = 0 MEANS ROWS, #AXIS = 1 MEAN COLUMN, IT'S A NUMPY FUNCTION

    A   B   C   A   B   C
0  A0  B0  C0  A4  B4  C4
1  A1  B1  C1  A5  B5  C5
2  A2  B2  C2  A6  B6  C6
3  A3  B3  C3  A7  B7  C7

# MERGING AND JOINING DATA FRAME

# merging

In [16]:
import pandas as pd

In [17]:
left = pd.DataFrame({'key':['K0','K1','K2','K3'],'A':['A0','A1','A2','A3'],'B':['B10','B1','B2','B3']})
right = pd.DataFrame({'key':['K0','K1','K2','K3'],'C':['C0','C1','C2','C3'],'D':['D0','D1','D2','D3']})

In [18]:
pd.merge(left,right,how='inner',on='key')

  key   A    B   C   D
0  K0  A0  B10  C0  D0
1  K1  A1   B1  C1  D1
2  K2  A2   B2  C2  D2
3  K3  A3   B3  C3  D3

In [21]:
left = pd.DataFrame({'A':['A0','A1','A2','A3'],'B':['B10','B1','B2','B3']}, index=['K0','K1','K2','K3'])
right = pd.DataFrame({'C':['C0','C1','C2','C3'],'D':['D0','D1','D2','D3']}, index= ['K0','K1','K2','K3'])

In [22]:
display(left,right)

     A    B
K0  A0  B10
K1  A1   B1
K2  A2   B2
K3  A3   B3

     C   D
K0  C0  D0
K1  C1  D1
K2  C2  D2
K3  C3  D3

# merge

In [23]:
left.join(right)

     A    B   C   D
K0  A0  B10  C0  D0
K1  A1   B1  C1  D1
K2  A2   B2  C2  D2
K3  A3   B3  C3  D3

In [23]:
left.join(right)

     A    B   C   D
K0  A0  B10  C0  D0
K1  A1   B1  C1  D1
K2  A2   B2  C2  D2
K3  A3   B3  C3  D3

In [24]:
right.join(left)

     C   D   A    B
K0  C0  D0  A0  B10
K1  C1  D1  A1   B1
K2  C2  D2  A2   B2
K3  C3  D3  A3   B3

In [28]:
left = pd.DataFrame({'key':['K0','K1','K2','K3'],'A':['A0','A1','A2','A3'],'B':['B10','B1','B2','B3']})
right = pd.DataFrame({'key':['K0','K1','K2','K3'],'C':['C0','C1','C2','C3'],'D':['D0','D1','D2','D3']})

In [ ]:
left = pd.DataFrame({'key1':['K0','K0','K1','K2','key2':['K0','K1','K0','K1','A':['A0','A1','A2','A3'],'B':['B10','B1','B2','B3']})
right = pd.DataFrame({'key1':['K0','K1','K1','K2'],'key2':['K0','K0','K0','K0'],'C':['C0','C1','C2','C3'],'D':['D0','D1','D2','D3']})

In [ ]:
df_out=pd.merge(left,right, how='outer',on =['key1','key2'])
df_out

In [32]:
pd.merge(left,right)

  key   A    B   C   D
0  K0  A0  B10  C0  D0
1  K1  A1   B1  C1  D1
2  K2  A2   B2  C2  D2
3  K3  A3   B3  C3  D3